<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"a3ee0bc3eca053a336ef114a625eebd9e5f696bb1ee17ee62c642f432c158860","plan_job_ref":"Job .github/workflows/_test-tf.yaml #195 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11361140253","plan_out_hash":"62ef8e52eac654b8a3a29e2b7d2b936bb7856c67c984d00579c6323a901c0dff","plan_hash":"4af238a1a0c0a9d2bd9ea5070d8e3c0231e86050aab29c24098af5d8496a8ef0","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #195](https://github.com/tx-pts-dai/github-workflows/actions/runs/11361140253)